examples/creation_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xml:lang="en-US">
   <s:Header>
      <a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse</a:Action>
      <a:MessageID>uuid:8D269088-24A3-4F92-BA8C-B603A289E157</a:MessageID>
      <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
      <a:RelatesTo>uuid:8b8cb359-bd89-4c46-866a-cfb7661a1633</a:RelatesTo>
   </s:Header>
   <s:Body>
      <x:ResourceCreated>
         <a:Address>http://windows-host:5985/wsman</a:Address>
         <a:ReferenceParameters>
            <w:ResourceURI>http://schemas.microsoft.com/powershell/Microsoft.PowerShell</w:ResourceURI>
            <w:SelectorSet>
               <w:Selector Name="ShellId">00D8A208-E211-45B5-8BC9-F4504F341AA5</w:Selector>
            </w:SelectorSet>
         </a:ReferenceParameters>
      </x:ResourceCreated>
      <rsp:Shell>
         <rsp:ShellId>00D8A208-E211-45B5-8BC9-F4504F341AA5</rsp:ShellId>
         <rsp:ResourceUri>http://schemas.microsoft.com/powershell/Microsoft.PowerShell</rsp:ResourceUri>
         <rsp:Owner>administrator</rsp:Owner>
         <rsp:ClientIP>192.168.1.113</rsp:ClientIP>
         <rsp:IdleTimeOut>PT7200.000S</rsp:IdleTimeOut>
         <rsp:InputStreams>stdin pr</rsp:InputStreams>
         <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
         <rsp:ShellRunTime>P0DT0H0M0S</rsp:ShellRunTime>
         <rsp:ShellInactivity>P0DT0H0M0S</rsp:ShellInactivity>
      </rsp:Shell>
   </s:Body>
</s:Envelope>